sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/pio.h
/**
 * \file
 *
 * \brief Component description for PIO
 *
 * Copyright (c) 2018 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-01-08T14:00:00Z */
#ifndef _SAMS70_PIO_COMPONENT_H_
#define _SAMS70_PIO_COMPONENT_H_
#define _SAMS70_PIO_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMS_SAMS70 Parallel Input/Output Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PIO */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define PIO_11004                      /**< (PIO) Module ID */
#define REV_PIO U                      /**< (PIO) Module revision */

/* -------- PIO_PER : (PIO Offset: 0x00) (/W 32) PIO Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  PIO Enable                               */
    uint32_t P1:1;                      /**< bit:      1  PIO Enable                               */
    uint32_t P2:1;                      /**< bit:      2  PIO Enable                               */
    uint32_t P3:1;                      /**< bit:      3  PIO Enable                               */
    uint32_t P4:1;                      /**< bit:      4  PIO Enable                               */
    uint32_t P5:1;                      /**< bit:      5  PIO Enable                               */
    uint32_t P6:1;                      /**< bit:      6  PIO Enable                               */
    uint32_t P7:1;                      /**< bit:      7  PIO Enable                               */
    uint32_t P8:1;                      /**< bit:      8  PIO Enable                               */
    uint32_t P9:1;                      /**< bit:      9  PIO Enable                               */
    uint32_t P10:1;                     /**< bit:     10  PIO Enable                               */
    uint32_t P11:1;                     /**< bit:     11  PIO Enable                               */
    uint32_t P12:1;                     /**< bit:     12  PIO Enable                               */
    uint32_t P13:1;                     /**< bit:     13  PIO Enable                               */
    uint32_t P14:1;                     /**< bit:     14  PIO Enable                               */
    uint32_t P15:1;                     /**< bit:     15  PIO Enable                               */
    uint32_t P16:1;                     /**< bit:     16  PIO Enable                               */
    uint32_t P17:1;                     /**< bit:     17  PIO Enable                               */
    uint32_t P18:1;                     /**< bit:     18  PIO Enable                               */
    uint32_t P19:1;                     /**< bit:     19  PIO Enable                               */
    uint32_t P20:1;                     /**< bit:     20  PIO Enable                               */
    uint32_t P21:1;                     /**< bit:     21  PIO Enable                               */
    uint32_t P22:1;                     /**< bit:     22  PIO Enable                               */
    uint32_t P23:1;                     /**< bit:     23  PIO Enable                               */
    uint32_t P24:1;                     /**< bit:     24  PIO Enable                               */
    uint32_t P25:1;                     /**< bit:     25  PIO Enable                               */
    uint32_t P26:1;                     /**< bit:     26  PIO Enable                               */
    uint32_t P27:1;                     /**< bit:     27  PIO Enable                               */
    uint32_t P28:1;                     /**< bit:     28  PIO Enable                               */
    uint32_t P29:1;                     /**< bit:     29  PIO Enable                               */
    uint32_t P30:1;                     /**< bit:     30  PIO Enable                               */
    uint32_t P31:1;                     /**< bit:     31  PIO Enable                               */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  PIO Enable                               */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PER_OFFSET                      (0x00)                                        /**<  (PIO_PER) PIO Enable Register  Offset */

#define PIO_PER_P0_Pos                      0                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P0_Msk                      (_U_(0x1) << PIO_PER_P0_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P0                          PIO_PER_P0_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P0_Msk instead */
#define PIO_PER_P1_Pos                      1                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P1_Msk                      (_U_(0x1) << PIO_PER_P1_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P1                          PIO_PER_P1_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P1_Msk instead */
#define PIO_PER_P2_Pos                      2                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P2_Msk                      (_U_(0x1) << PIO_PER_P2_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P2                          PIO_PER_P2_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P2_Msk instead */
#define PIO_PER_P3_Pos                      3                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P3_Msk                      (_U_(0x1) << PIO_PER_P3_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P3                          PIO_PER_P3_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P3_Msk instead */
#define PIO_PER_P4_Pos                      4                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P4_Msk                      (_U_(0x1) << PIO_PER_P4_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P4                          PIO_PER_P4_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P4_Msk instead */
#define PIO_PER_P5_Pos                      5                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P5_Msk                      (_U_(0x1) << PIO_PER_P5_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P5                          PIO_PER_P5_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P5_Msk instead */
#define PIO_PER_P6_Pos                      6                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P6_Msk                      (_U_(0x1) << PIO_PER_P6_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P6                          PIO_PER_P6_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P6_Msk instead */
#define PIO_PER_P7_Pos                      7                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P7_Msk                      (_U_(0x1) << PIO_PER_P7_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P7                          PIO_PER_P7_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P7_Msk instead */
#define PIO_PER_P8_Pos                      8                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P8_Msk                      (_U_(0x1) << PIO_PER_P8_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P8                          PIO_PER_P8_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P8_Msk instead */
#define PIO_PER_P9_Pos                      9                                              /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P9_Msk                      (_U_(0x1) << PIO_PER_P9_Pos)                   /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P9                          PIO_PER_P9_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P9_Msk instead */
#define PIO_PER_P10_Pos                     10                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P10_Msk                     (_U_(0x1) << PIO_PER_P10_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P10                         PIO_PER_P10_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P10_Msk instead */
#define PIO_PER_P11_Pos                     11                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P11_Msk                     (_U_(0x1) << PIO_PER_P11_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P11                         PIO_PER_P11_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P11_Msk instead */
#define PIO_PER_P12_Pos                     12                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P12_Msk                     (_U_(0x1) << PIO_PER_P12_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P12                         PIO_PER_P12_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P12_Msk instead */
#define PIO_PER_P13_Pos                     13                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P13_Msk                     (_U_(0x1) << PIO_PER_P13_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P13                         PIO_PER_P13_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P13_Msk instead */
#define PIO_PER_P14_Pos                     14                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P14_Msk                     (_U_(0x1) << PIO_PER_P14_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P14                         PIO_PER_P14_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P14_Msk instead */
#define PIO_PER_P15_Pos                     15                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P15_Msk                     (_U_(0x1) << PIO_PER_P15_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P15                         PIO_PER_P15_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P15_Msk instead */
#define PIO_PER_P16_Pos                     16                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P16_Msk                     (_U_(0x1) << PIO_PER_P16_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P16                         PIO_PER_P16_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P16_Msk instead */
#define PIO_PER_P17_Pos                     17                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P17_Msk                     (_U_(0x1) << PIO_PER_P17_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P17                         PIO_PER_P17_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P17_Msk instead */
#define PIO_PER_P18_Pos                     18                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P18_Msk                     (_U_(0x1) << PIO_PER_P18_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P18                         PIO_PER_P18_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P18_Msk instead */
#define PIO_PER_P19_Pos                     19                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P19_Msk                     (_U_(0x1) << PIO_PER_P19_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P19                         PIO_PER_P19_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P19_Msk instead */
#define PIO_PER_P20_Pos                     20                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P20_Msk                     (_U_(0x1) << PIO_PER_P20_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P20                         PIO_PER_P20_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P20_Msk instead */
#define PIO_PER_P21_Pos                     21                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P21_Msk                     (_U_(0x1) << PIO_PER_P21_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P21                         PIO_PER_P21_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P21_Msk instead */
#define PIO_PER_P22_Pos                     22                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P22_Msk                     (_U_(0x1) << PIO_PER_P22_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P22                         PIO_PER_P22_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P22_Msk instead */
#define PIO_PER_P23_Pos                     23                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P23_Msk                     (_U_(0x1) << PIO_PER_P23_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P23                         PIO_PER_P23_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P23_Msk instead */
#define PIO_PER_P24_Pos                     24                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P24_Msk                     (_U_(0x1) << PIO_PER_P24_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P24                         PIO_PER_P24_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P24_Msk instead */
#define PIO_PER_P25_Pos                     25                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P25_Msk                     (_U_(0x1) << PIO_PER_P25_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P25                         PIO_PER_P25_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P25_Msk instead */
#define PIO_PER_P26_Pos                     26                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P26_Msk                     (_U_(0x1) << PIO_PER_P26_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P26                         PIO_PER_P26_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P26_Msk instead */
#define PIO_PER_P27_Pos                     27                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P27_Msk                     (_U_(0x1) << PIO_PER_P27_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P27                         PIO_PER_P27_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P27_Msk instead */
#define PIO_PER_P28_Pos                     28                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P28_Msk                     (_U_(0x1) << PIO_PER_P28_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P28                         PIO_PER_P28_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P28_Msk instead */
#define PIO_PER_P29_Pos                     29                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P29_Msk                     (_U_(0x1) << PIO_PER_P29_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P29                         PIO_PER_P29_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P29_Msk instead */
#define PIO_PER_P30_Pos                     30                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P30_Msk                     (_U_(0x1) << PIO_PER_P30_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P30                         PIO_PER_P30_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P30_Msk instead */
#define PIO_PER_P31_Pos                     31                                             /**< (PIO_PER) PIO Enable Position */
#define PIO_PER_P31_Msk                     (_U_(0x1) << PIO_PER_P31_Pos)                  /**< (PIO_PER) PIO Enable Mask */
#define PIO_PER_P31                         PIO_PER_P31_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PER_P31_Msk instead */
#define PIO_PER_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_PER) Register MASK  (Use PIO_PER_Msk instead)  */
#define PIO_PER_Msk                         _U_(0xFFFFFFFF)                                /**< (PIO_PER) Register Mask  */

