sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/pio.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_ISR_OFFSET                      (0x4C)                                        /**<  (PIO_ISR) Interrupt Status Register  Offset */

#define PIO_ISR_P0_Pos                      0                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P0_Msk                      (_U_(0x1) << PIO_ISR_P0_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P0                          PIO_ISR_P0_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P0_Msk instead */
#define PIO_ISR_P1_Pos                      1                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P1_Msk                      (_U_(0x1) << PIO_ISR_P1_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P1                          PIO_ISR_P1_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P1_Msk instead */
#define PIO_ISR_P2_Pos                      2                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P2_Msk                      (_U_(0x1) << PIO_ISR_P2_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P2                          PIO_ISR_P2_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P2_Msk instead */
#define PIO_ISR_P3_Pos                      3                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P3_Msk                      (_U_(0x1) << PIO_ISR_P3_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P3                          PIO_ISR_P3_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P3_Msk instead */
#define PIO_ISR_P4_Pos                      4                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P4_Msk                      (_U_(0x1) << PIO_ISR_P4_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P4                          PIO_ISR_P4_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P4_Msk instead */
#define PIO_ISR_P5_Pos                      5                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P5_Msk                      (_U_(0x1) << PIO_ISR_P5_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P5                          PIO_ISR_P5_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P5_Msk instead */
#define PIO_ISR_P6_Pos                      6                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P6_Msk                      (_U_(0x1) << PIO_ISR_P6_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P6                          PIO_ISR_P6_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P6_Msk instead */
#define PIO_ISR_P7_Pos                      7                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P7_Msk                      (_U_(0x1) << PIO_ISR_P7_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P7                          PIO_ISR_P7_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P7_Msk instead */
#define PIO_ISR_P8_Pos                      8                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P8_Msk                      (_U_(0x1) << PIO_ISR_P8_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P8                          PIO_ISR_P8_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P8_Msk instead */
#define PIO_ISR_P9_Pos                      9                                              /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P9_Msk                      (_U_(0x1) << PIO_ISR_P9_Pos)                   /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P9                          PIO_ISR_P9_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P9_Msk instead */
#define PIO_ISR_P10_Pos                     10                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P10_Msk                     (_U_(0x1) << PIO_ISR_P10_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P10                         PIO_ISR_P10_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P10_Msk instead */
#define PIO_ISR_P11_Pos                     11                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P11_Msk                     (_U_(0x1) << PIO_ISR_P11_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P11                         PIO_ISR_P11_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P11_Msk instead */
#define PIO_ISR_P12_Pos                     12                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P12_Msk                     (_U_(0x1) << PIO_ISR_P12_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P12                         PIO_ISR_P12_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P12_Msk instead */
#define PIO_ISR_P13_Pos                     13                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P13_Msk                     (_U_(0x1) << PIO_ISR_P13_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P13                         PIO_ISR_P13_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P13_Msk instead */
#define PIO_ISR_P14_Pos                     14                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P14_Msk                     (_U_(0x1) << PIO_ISR_P14_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P14                         PIO_ISR_P14_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P14_Msk instead */
#define PIO_ISR_P15_Pos                     15                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P15_Msk                     (_U_(0x1) << PIO_ISR_P15_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P15                         PIO_ISR_P15_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P15_Msk instead */
#define PIO_ISR_P16_Pos                     16                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P16_Msk                     (_U_(0x1) << PIO_ISR_P16_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P16                         PIO_ISR_P16_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P16_Msk instead */
#define PIO_ISR_P17_Pos                     17                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P17_Msk                     (_U_(0x1) << PIO_ISR_P17_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P17                         PIO_ISR_P17_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P17_Msk instead */
#define PIO_ISR_P18_Pos                     18                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P18_Msk                     (_U_(0x1) << PIO_ISR_P18_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P18                         PIO_ISR_P18_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P18_Msk instead */
#define PIO_ISR_P19_Pos                     19                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P19_Msk                     (_U_(0x1) << PIO_ISR_P19_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P19                         PIO_ISR_P19_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P19_Msk instead */
#define PIO_ISR_P20_Pos                     20                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P20_Msk                     (_U_(0x1) << PIO_ISR_P20_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P20                         PIO_ISR_P20_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P20_Msk instead */
#define PIO_ISR_P21_Pos                     21                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P21_Msk                     (_U_(0x1) << PIO_ISR_P21_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P21                         PIO_ISR_P21_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P21_Msk instead */
#define PIO_ISR_P22_Pos                     22                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P22_Msk                     (_U_(0x1) << PIO_ISR_P22_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P22                         PIO_ISR_P22_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P22_Msk instead */
#define PIO_ISR_P23_Pos                     23                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P23_Msk                     (_U_(0x1) << PIO_ISR_P23_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P23                         PIO_ISR_P23_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P23_Msk instead */
#define PIO_ISR_P24_Pos                     24                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P24_Msk                     (_U_(0x1) << PIO_ISR_P24_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P24                         PIO_ISR_P24_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P24_Msk instead */
#define PIO_ISR_P25_Pos                     25                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P25_Msk                     (_U_(0x1) << PIO_ISR_P25_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P25                         PIO_ISR_P25_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P25_Msk instead */
#define PIO_ISR_P26_Pos                     26                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P26_Msk                     (_U_(0x1) << PIO_ISR_P26_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P26                         PIO_ISR_P26_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P26_Msk instead */
#define PIO_ISR_P27_Pos                     27                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P27_Msk                     (_U_(0x1) << PIO_ISR_P27_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P27                         PIO_ISR_P27_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P27_Msk instead */
#define PIO_ISR_P28_Pos                     28                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P28_Msk                     (_U_(0x1) << PIO_ISR_P28_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P28                         PIO_ISR_P28_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P28_Msk instead */
#define PIO_ISR_P29_Pos                     29                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P29_Msk                     (_U_(0x1) << PIO_ISR_P29_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P29                         PIO_ISR_P29_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P29_Msk instead */
#define PIO_ISR_P30_Pos                     30                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P30_Msk                     (_U_(0x1) << PIO_ISR_P30_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P30                         PIO_ISR_P30_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P30_Msk instead */
#define PIO_ISR_P31_Pos                     31                                             /**< (PIO_ISR) Input Change Interrupt Status Position */
#define PIO_ISR_P31_Msk                     (_U_(0x1) << PIO_ISR_P31_Pos)                  /**< (PIO_ISR) Input Change Interrupt Status Mask */
#define PIO_ISR_P31                         PIO_ISR_P31_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ISR_P31_Msk instead */
#define PIO_ISR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_ISR) Register MASK  (Use PIO_ISR_Msk instead)  */
#define PIO_ISR_Msk                         _U_(0xFFFFFFFF)                                /**< (PIO_ISR) Register Mask  */

