sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/pio.h
#define PIO_DRIVER_LINE19_Msk               (_U_(0x1) << PIO_DRIVER_LINE19_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 19 Mask */
#define PIO_DRIVER_LINE19                   PIO_DRIVER_LINE19_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE19_Msk instead */
#define   PIO_DRIVER_LINE19_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE19_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE19_LOW_DRIVE         (PIO_DRIVER_LINE19_LOW_DRIVE_Val << PIO_DRIVER_LINE19_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE19_HIGH_DRIVE        (PIO_DRIVER_LINE19_HIGH_DRIVE_Val << PIO_DRIVER_LINE19_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE20_Pos               20                                             /**< (PIO_DRIVER) Drive of PIO Line 20 Position */
#define PIO_DRIVER_LINE20_Msk               (_U_(0x1) << PIO_DRIVER_LINE20_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 20 Mask */
#define PIO_DRIVER_LINE20                   PIO_DRIVER_LINE20_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE20_Msk instead */
#define   PIO_DRIVER_LINE20_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE20_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE20_LOW_DRIVE         (PIO_DRIVER_LINE20_LOW_DRIVE_Val << PIO_DRIVER_LINE20_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE20_HIGH_DRIVE        (PIO_DRIVER_LINE20_HIGH_DRIVE_Val << PIO_DRIVER_LINE20_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE21_Pos               21                                             /**< (PIO_DRIVER) Drive of PIO Line 21 Position */
#define PIO_DRIVER_LINE21_Msk               (_U_(0x1) << PIO_DRIVER_LINE21_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 21 Mask */
#define PIO_DRIVER_LINE21                   PIO_DRIVER_LINE21_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE21_Msk instead */
#define   PIO_DRIVER_LINE21_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE21_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE21_LOW_DRIVE         (PIO_DRIVER_LINE21_LOW_DRIVE_Val << PIO_DRIVER_LINE21_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE21_HIGH_DRIVE        (PIO_DRIVER_LINE21_HIGH_DRIVE_Val << PIO_DRIVER_LINE21_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE22_Pos               22                                             /**< (PIO_DRIVER) Drive of PIO Line 22 Position */
#define PIO_DRIVER_LINE22_Msk               (_U_(0x1) << PIO_DRIVER_LINE22_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 22 Mask */
#define PIO_DRIVER_LINE22                   PIO_DRIVER_LINE22_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE22_Msk instead */
#define   PIO_DRIVER_LINE22_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE22_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE22_LOW_DRIVE         (PIO_DRIVER_LINE22_LOW_DRIVE_Val << PIO_DRIVER_LINE22_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE22_HIGH_DRIVE        (PIO_DRIVER_LINE22_HIGH_DRIVE_Val << PIO_DRIVER_LINE22_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE23_Pos               23                                             /**< (PIO_DRIVER) Drive of PIO Line 23 Position */
#define PIO_DRIVER_LINE23_Msk               (_U_(0x1) << PIO_DRIVER_LINE23_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 23 Mask */
#define PIO_DRIVER_LINE23                   PIO_DRIVER_LINE23_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE23_Msk instead */
#define   PIO_DRIVER_LINE23_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE23_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE23_LOW_DRIVE         (PIO_DRIVER_LINE23_LOW_DRIVE_Val << PIO_DRIVER_LINE23_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE23_HIGH_DRIVE        (PIO_DRIVER_LINE23_HIGH_DRIVE_Val << PIO_DRIVER_LINE23_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE24_Pos               24                                             /**< (PIO_DRIVER) Drive of PIO Line 24 Position */
#define PIO_DRIVER_LINE24_Msk               (_U_(0x1) << PIO_DRIVER_LINE24_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 24 Mask */
#define PIO_DRIVER_LINE24                   PIO_DRIVER_LINE24_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE24_Msk instead */
#define   PIO_DRIVER_LINE24_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE24_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE24_LOW_DRIVE         (PIO_DRIVER_LINE24_LOW_DRIVE_Val << PIO_DRIVER_LINE24_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE24_HIGH_DRIVE        (PIO_DRIVER_LINE24_HIGH_DRIVE_Val << PIO_DRIVER_LINE24_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE25_Pos               25                                             /**< (PIO_DRIVER) Drive of PIO Line 25 Position */
#define PIO_DRIVER_LINE25_Msk               (_U_(0x1) << PIO_DRIVER_LINE25_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 25 Mask */
#define PIO_DRIVER_LINE25                   PIO_DRIVER_LINE25_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE25_Msk instead */
#define   PIO_DRIVER_LINE25_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE25_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE25_LOW_DRIVE         (PIO_DRIVER_LINE25_LOW_DRIVE_Val << PIO_DRIVER_LINE25_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE25_HIGH_DRIVE        (PIO_DRIVER_LINE25_HIGH_DRIVE_Val << PIO_DRIVER_LINE25_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE26_Pos               26                                             /**< (PIO_DRIVER) Drive of PIO Line 26 Position */
#define PIO_DRIVER_LINE26_Msk               (_U_(0x1) << PIO_DRIVER_LINE26_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 26 Mask */
#define PIO_DRIVER_LINE26                   PIO_DRIVER_LINE26_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE26_Msk instead */
#define   PIO_DRIVER_LINE26_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE26_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE26_LOW_DRIVE         (PIO_DRIVER_LINE26_LOW_DRIVE_Val << PIO_DRIVER_LINE26_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE26_HIGH_DRIVE        (PIO_DRIVER_LINE26_HIGH_DRIVE_Val << PIO_DRIVER_LINE26_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE27_Pos               27                                             /**< (PIO_DRIVER) Drive of PIO Line 27 Position */
#define PIO_DRIVER_LINE27_Msk               (_U_(0x1) << PIO_DRIVER_LINE27_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 27 Mask */
#define PIO_DRIVER_LINE27                   PIO_DRIVER_LINE27_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE27_Msk instead */
#define   PIO_DRIVER_LINE27_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE27_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE27_LOW_DRIVE         (PIO_DRIVER_LINE27_LOW_DRIVE_Val << PIO_DRIVER_LINE27_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE27_HIGH_DRIVE        (PIO_DRIVER_LINE27_HIGH_DRIVE_Val << PIO_DRIVER_LINE27_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE28_Pos               28                                             /**< (PIO_DRIVER) Drive of PIO Line 28 Position */
#define PIO_DRIVER_LINE28_Msk               (_U_(0x1) << PIO_DRIVER_LINE28_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 28 Mask */
#define PIO_DRIVER_LINE28                   PIO_DRIVER_LINE28_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE28_Msk instead */
#define   PIO_DRIVER_LINE28_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE28_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE28_LOW_DRIVE         (PIO_DRIVER_LINE28_LOW_DRIVE_Val << PIO_DRIVER_LINE28_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE28_HIGH_DRIVE        (PIO_DRIVER_LINE28_HIGH_DRIVE_Val << PIO_DRIVER_LINE28_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE29_Pos               29                                             /**< (PIO_DRIVER) Drive of PIO Line 29 Position */
#define PIO_DRIVER_LINE29_Msk               (_U_(0x1) << PIO_DRIVER_LINE29_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 29 Mask */
#define PIO_DRIVER_LINE29                   PIO_DRIVER_LINE29_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE29_Msk instead */
#define   PIO_DRIVER_LINE29_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE29_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE29_LOW_DRIVE         (PIO_DRIVER_LINE29_LOW_DRIVE_Val << PIO_DRIVER_LINE29_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE29_HIGH_DRIVE        (PIO_DRIVER_LINE29_HIGH_DRIVE_Val << PIO_DRIVER_LINE29_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE30_Pos               30                                             /**< (PIO_DRIVER) Drive of PIO Line 30 Position */
#define PIO_DRIVER_LINE30_Msk               (_U_(0x1) << PIO_DRIVER_LINE30_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 30 Mask */
#define PIO_DRIVER_LINE30                   PIO_DRIVER_LINE30_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE30_Msk instead */
#define   PIO_DRIVER_LINE30_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE30_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE30_LOW_DRIVE         (PIO_DRIVER_LINE30_LOW_DRIVE_Val << PIO_DRIVER_LINE30_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE30_HIGH_DRIVE        (PIO_DRIVER_LINE30_HIGH_DRIVE_Val << PIO_DRIVER_LINE30_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE31_Pos               31                                             /**< (PIO_DRIVER) Drive of PIO Line 31 Position */
#define PIO_DRIVER_LINE31_Msk               (_U_(0x1) << PIO_DRIVER_LINE31_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 31 Mask */
#define PIO_DRIVER_LINE31                   PIO_DRIVER_LINE31_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE31_Msk instead */
#define   PIO_DRIVER_LINE31_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE31_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE31_LOW_DRIVE         (PIO_DRIVER_LINE31_LOW_DRIVE_Val << PIO_DRIVER_LINE31_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE31_HIGH_DRIVE        (PIO_DRIVER_LINE31_HIGH_DRIVE_Val << PIO_DRIVER_LINE31_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_DRIVER) Register MASK  (Use PIO_DRIVER_Msk instead)  */
#define PIO_DRIVER_Msk                      _U_(0xFFFFFFFF)                                /**< (PIO_DRIVER) Register Mask  */

#define PIO_DRIVER_LINE_Pos                 0                                              /**< (PIO_DRIVER Position) Drive of PIO Line 3x */
#define PIO_DRIVER_LINE_Msk                 (_U_(0xFFFFFFFF) << PIO_DRIVER_LINE_Pos)       /**< (PIO_DRIVER Mask) LINE */
#define PIO_DRIVER_LINE(value)              (PIO_DRIVER_LINE_Msk & ((value) << PIO_DRIVER_LINE_Pos))  

